# Це наш головний скрипт, який буде запущений, коли ви запустите .exe файл програми.
# Якщо ви користуєтесь цим ботом прямо через код на Python,
# ви повиннi запустити саме цей файл i нiякий не iнший.

# Давайте iмпортуємо всi потрiбнi модулi.
# Спочатку, iмпортуємо модуль sys, щоб використовувати метод sys.exit(), який
# буде завершувати роботу програми, якщо виникне помилка в Tesseract-OCR
import sys
# Далi, нам знадобиться метод `sleep` з модуля time, для створення 10-секундної
# затримки пiсля того, як всi данi для бота вказанi.
from time import sleep
# Iмпортуємо сам клас Bot зi скрипта bot.py
from bot import Bot
# Та нарештi, iмпортуємо потрiбне зi скрипта core.py: функцiї для отримання
# координат кнопки додавання паузи та таймлайна для бота,
# для знахождення тексту на скриншотi, використовуючи Tesseract-OCR,
# для самого скриншота, та класс NotEverythingFoundError,
# для того, щоб обробляти цей виняток, коли виникають
# проблеми з отриманням координат для бота
from core import get_coords_for_bot, find_text, take_screenshot, NotEverythingFoundError

# Головний блок нашої програми
if __name__ == "__main__":
    # Спочатку ми вiтаємось iз користувачем у консолi
    # та просимо його слiдувати iнструкцiям
    print("Вас вiтає adbot вiд vsdum! Будь ласка, слiдуйте iнструкцiям...")
    # Далi ми iнiцiалiзуємо об'єкт бота,
    # вiн отримає тривалiсть вiдео у хвилинах та секундах, та iнтервал
    # мiж рекламними паузами, вiд користувача
    bot = Bot()
    print("Об\'єкт бота iнiцiалiзований!")
    print("Тепер у вас є 10 секунд на те, щоб вiдкрити сторiнку редактора рекламних пауз на вiдео на YouTube.")
    # Тепер ми даємо нашому користувачу 10 секунд на вiдкриття сторiнки редактора вiдео пiсля натискання Enter
    input("Натиснiть Enter, щоб запустити цей таймер. ")
    # Тут ми використовуємо метод `sleep` з модуля time для встановлення 10-секундної затримки
    sleep(10)
    # Отримуємо список символiв, знайдених Tesseract-OCR на скриншотi
    data = find_text(take_screenshot())
    # Якщо Tesseract-OCR не встановлений на вашому комп'ютерi, програма `помре`
    # Цього не повинно статись, тому що якщо ви ранiше не встановлювали Tesseract-OCR,
    # програма встановить його локально з Iнтернета автоматично.
    if data is None:
        sys.exit()
    else:
        # Отже, якщо не з'явилось проблем зi знаходженням Tesseract-OCR на комп'ютерi користувача,
        # ми запускаємо головний процес. Тут спочатку ми отримуємо координати кнопки додавання рекламної паузи та таймлайна.
        # Звернiть увагу на те, що ми додали обробку винятку, на випадок якщо не всi координати будуть знайденi ОРС.
        try:
            coords = get_coords_for_bot(data)
            # Коли ми отримали всi потрiбнi координати, вказуємо їх в об'єктi бота
            bot.specify_coords(coords[0], coords[1], coords[2], coords[3])
            # I нарештi, запускаємо нашого бота
            bot.run()
            print("Дякую за використання мого бота! Я бажаю вам удачi з вашим каналом на YouTube!")
            input("Натиснiть Enter, щоб вийти.")
        # Якщо виникає виняток, ми просто кажемо користувачу, що сталося.
        # У кiнцi ми викликаємо input(), щоб дати користувачу час на прочитання вихiдних даних у консолi.
        except NotEverythingFoundError:
            print("ПОМИЛКА: Не всi потрiбнi координати були знайденi системою ОРС. Спробуйте ще раз (спробуйте змiнити тему браузера на свiтлу, або збiльшити масштаб iнтерфейса)")
            input()